{
  "pfus-name": "PFUS1: Pelvic Floor Segmentation",
  "pfus-category": "Healthcare",
  "pfus.keywords": "Deep learning, image processing, segmentation",
  "pfslot-name": "PFSLOT: Parking Lot Abandonment Prediction",
  "pfslot-category": "Urban Planning",
  "pfslot-keywords": "Deep learning, image processing, regression",
  "markme-name": "MARKME: Automatic Code Evaluation",
  "markme-category": "Teaching",
  "markme-keywords": "Deep learning, text processing, regression",
  "working-on": "We are working on it...",
  "more": "Learn more",
  "pfus-description": "<p>Ultrasound of the pelvic floor has become an essential tool in contemporary pelvic floor analysis, enabling its application for the detection of various pelvic floor dysfunctions such as pelvic organ prolapse, urinary and fecal incontinence, and defecation disorders, among others. Over the past two decades, ultrasound has emerged as a mainstream diagnostic tool, and the methodology for obtaining images is well-established in the literature.</p><p>There are several ultrasound methods for pelvic floor evaluation. Transperineal ultrasound allows obtaining the midsagittal plane, enabling the analysis of eight different organs: pubis, urethra, bladder, vagina, uterus, anus, rectum, and levator ani muscle. Additionally, this plane allows studying the dynamic aspects of the organs and dysfunctions associated with that dynamics, such as pelvic organ prolapse.</p><img width='50%' class='float-end' style='margin-left:2rem;' src='../images/segment_ani.gif'><p>However, the analysis of images obtained through ultrasound requires manual measurements prior to diagnosis, demanding time and experience from the sonographer. This issue can lead to variations in outcomes among individual sonographers, as differences may arise in organ detections and measurements. Currently, there is a deficiency in technology to assist sonographers in standardizing their findings. A tool designed to aid sonographers in accurately identifying organs in the midsagittal plane can streamline and enhance the application of these techniques in daily clinical consultations.</p><p>The present dataset has been created from 111 patients. From each patient, a sequence of ultrasound images has been taken during the Valsalva maneuver. The dataset has been divided into 86 patients for training and 25 patients for testing. Each frame of the sequence has been labeled with the 8 organs mentioned above with the aim of training models for automatic segmentation of ultrasound images.</p><div class='container'><div class='row'><div class='col-md-4'><h3>What is PFUS1?</h3><p>PFUS1 is the first dataset focused on pelvic floor segmentation in the midsagittal plane. PFUS1 has the following characteristics:</p><ul class='list-unstyled'><li><i class='fas fa-check'>&nbsp;</i>Segmentation of images</li><li><i class='fas fa-check'>&nbsp;</i>Ultrasound images</li><li><i class='fas fa-check'>&nbsp;</i>8 categories</li><li><i class='fas fa-check'>&nbsp;</i>111 patients</li><li><i class='fas fa-check'>&nbsp;</i>345,000 images</li></ul></div><div class='col-md-4'><h3>Authors</h3><ul class='list-unstyled'><li><strong>José Antonio García-Mejido</strong>&nbsp;OG</li><li><strong>David Solís-Martín</strong>&nbsp;CCIA</li><li><strong>José Antonio Sainz</strong>&nbsp;OG</li></ul><p>CCIA: Department of Computer Science and Artificial Intelligence, University of Seville</p><p>OG: Department of Obstetrics and Gynecology, Valme University Hospital, Seville.</p></div><div class='col-md-4'><h3>Acknowledgments</h3><ul class='list-unstyled'><li>Project PID2019-109152GB-I00</li><li><img src='https://investigacion.us.es/sisius/sisimg/logos/m_ciencia_innovacion_universidades.png' /></li><li><img width='100%' src='https://www.us.es/sites/default/files/inline-images/US-marca-digital_0.png' /></li><li><img width='100%' src='../images/valme.jpg' /></li></ul></div></div><h3>Download</h3><p>Access to this dataset is restricted to universities or research groups.</p><p>To request the download of the dataset, please send an email to dsolis 'at' us.es from an institutional email account, indicating the purpose for which the dataset will be used.</p>"
}

