{
  "pfus-name":"PFUS1: Segmentación del suelo pélvico",
  "pfus-category": "Sanidad",
  "pfus.keywords": "Deep learning, procesamiento de imágenes, segmentación",
  "pfslot-name": "PFSLOT: Predicción de abandono en aparcamientos",
  "pfslot-category": "Urbanismo",
  "pfslot-keywords": "Deep learning, procesamiento de imágenes, regresión",
  "markme-name": "MARKME: Evaluación automática de código",
  "markme-category": "Docencia",
  "markme-keywords": "Deep learning, procesamiento de text, regresión",
  "working-on": "Estamos trabajando en ello...",
  "more": "Saber más",
  "pfus-description": "<p>La ecografía del suelo pélvico se ha convertido en una herramienta esencial en el análisis contemporáneo del suelo pélvico, permitiendo su aplicación para la detección de diversas disfunciones del suelo pélvico, como el prolapso de órganos pélvicos, la incontinencia urinaria y fecal, y trastornos de la defecación, entre otros. En las últimas dos décadas, la ecografía ha surgido como una herramienta de diagnóstico principal, y la metodología para obtener imágenes está bien establecida en la literatura.</p><p>Existen varios métodos de ecografía para la evaluación del suelo pélvico. La ecografía transperineal permite obtener el plano midsagital. Este plano permite el análisis de ocho órganos diferentes: el pubis, la uretra, la vejiga, la vagina, el útero, el ano, el recto y el músculo elevador del ano. Además, este plano permite estudiar los aspectos dinámicos de los órganos y las disfunciones asociadas a esa dinámica, como el prolapso de órganos pélvicos.</p><p>Sin embargo, el análisis de imágenes obtenidas mediante ecografía requiere mediciones manuales previas al diagnóstico, lo que demanda tiempo y experiencia por parte del ecografista. Este problema puede llevar a variaciones en los resultados entre ecografistas individuales, ya que pueden surgir diferencias en la detección y medición de órganos. Actualmente, existe una carencia de tecnología para ayudar a los ecografistas a estandarizar sus hallazgos. Una herramienta diseñada para ayudar a los ecografistas a identificar con precisión los órganos en el plano midsagital puede simplificar y mejorar la aplicación de estas técnicas en las consultas clínicas diarias.</p><img width='50%' class='float-end' style='margin-left:2rem;' src='../images/segment_ani.gif'><p>El presente conjunto se ha creado a partir de 111 pacientes. De cada paciente se ha tomado una secuencia de imágenes ecográficas llevando a cabo la maniobra de Valsalva. El conjunto de datos se ha dividido en 86 pacientes para entrenamiento y 25 pacientes para test. Cada frame de la secuencia se ha etiquetado con los 8 órganos indicados anteriormente con el objetivo de entrenar modelos para llevar a cabo la segmentación de las imágenes ecográficas de manera automática.</p><br><div class='container'><div class='row'><div class='col-md-4'><h3>¿Qué es PFUS1?</h3><p>PFUS1 es el primer conjunto de datos orientado a la segmentación del suelo pélvico en el plano midsagital. PFUS1 tiene las siguientes características:</p><ul class='list-unstyled'><li><i class='fas fa-check'>&nbsp;</i>Segmentación de imágenes</li><li><i class='fas fa-check'>&nbsp;</i>Imágenes ecográficas</li><li><i class='fas fa-check'>&nbsp;</i>8 categorías</li><li><i class='fas fa-check'>&nbsp;</i>111 pacientes</li><li><i class='fas fa-check'>&nbsp;</i>345,000 imágenes</li></ul></div><div class='col-md-4'><h3>Autores</h3><ul class='list-unstyled'><li><strong>José Antonio García-Mejido</strong>&nbsp;OG</li><li><strong>David Solís-Martín</strong>&nbsp;CCIA</li><li><strong>José Antonio Sainz</strong>&nbsp;OG</li></ul><br><p>CCIA: Departamento de Ciencias de Computación e Inteligencia Artificial de la Universidad de Sevilla</p><p>OG: Departamento de Obstetricia y Ginecología del Hospital Universitario de Valme, Sevilla.</p></div><div class='col-md-4'><h3>Agradecimientos</h3><ul class='list-unstyled'><li>Proyecto PID2019-109152GB-I00</li><li><img src='https://investigacion.us.es/sisius/sisimg/logos/m_ciencia_innovacion_universidades.png' /></li><li><img width='100%' src='https://www.us.es/sites/default/files/inline-images/US-marca-digital_0.png' /></li><li><img width='100%' src='../images/valme.jpg' /></li></ul></div></div><h3>Descarga</h3><p>El acceso a este conjunto de datos está limitado a universidades o grupos de investigación.</p><p>Para solicitar la descarga del conjunto de datos, por favor, envíe un correo electrónico a dsolis 'at' us.es desde una cuenta de correo institucional, indicando el propósito para el cual se utilizará el conjunto de datos.</p>"
}
